"""
Модуль с константами, содержащими текста, которые часто используются.


Автор: danisimore
Дата: 10.01.2024

"""

MAIN_MENU = "Главное меню"
MAIN_MENU_TEXT = """
Доброго времени суток <b>%s</b> 👋!\n\nДобро пожаловать в бота Цветы Майя.\n
Данный бот поможет вам выбрать лучший букет 💐, за сумму на которую вы рассчитываете, а также поможет вам оформить
дисконтную карту, для совершения покупок с максимальной выгодой.\n
Мы внимательно контролируем логистику и сроки доставки каждого букета 🧐. У нас 
работает команда профессиональных флористов, которые подберут и составят яркий 
букет на любой вкус и случай.\n
Для нас дорог каждый клиент 🙏!
"""
ABOUT_DISCOUNT_PROGRAM = """
Дорогой покупатель, рады сообщить вам о нашей дисконтной программе 💳!\n
С каждой покупки вы получаете 5% бонусами,
которые можно использовать для оплаты до 50% от стоимости вашего следующего заказа 💰.\n
Это отличная возможность экономить на свежих цветах и создавать волшебные букеты 💐 с дополнительными преимуществами.\n
Хотите ли вы стать участником нашей дисконтной программы?
"""
DISCOUNT_REGISTRATION_APPLICATION = """
Новая заявка на регистрацию в дисконтной программе!

Информация о клиенте:
%s
"""
