"""
Модуль для валидации номера телефона, который вводит пользователь в чат с ботом.


Автор: danisimore
Дата: 10.01.2024


Функция в данном модуле принимает параметр phone_number - номер телефона, который указывает пользователь. Далее номер
телефона сопоставляется с регулярным выражением и находится совпадение, то возвращается True, иначе False.
"""

import re


def phone_num_validator(phone_number) -> bool:
    """
    Валидатор номера телефона.

    :param phone_number: номер телефона;
    :return: True если номер телефона соответствует регулярному выражению
    """
    result = re.match(
        r'^(\+7|7|8)?[\s\-]?\(?[489][0-9]{2}\)?[\s\-]?[0-9]{3}[\s\-]?[0-9]{2}[\s\-]?[0-9]{2}$',
        phone_number
    )

    return bool(result)
